app/controllers/user_controller.rb

  def schedule
    @user = User.first
---
SELECT "users".* FROM "users" WHERE (username = NULL) LIMIT 1